app/Http/Controllers/Auth/LoginController.php

    public function callback($provider) {
        \Log::debug("message: ".$provider);
        $getInfo = Socialite::driver($provider)->stateless()->user();
        $link = $_COOKIE['link_file']??'';
        // Nếu thông tin facebook trả về không có Email thì thông báo
        if(!$getInfo->email) {

            return redirect(Session::get('back_url','/'))->with(['flash_level'=>'danger','flash_message'=> 'Tài khoản của bạn không hoạt động.']);

        } else {
            // Nếu có Email thì check tồn tại trong hệ thống
            $findUser = User::where('email', $getInfo->email)->first();
---
select * from `users` where `email` = 'phongtrank55@gmail.com' limit 1