app/Http/Controllers/ReportController.php

    public function index(){
        $report = InvoiceDetail::with('product')->select('product_id', 'product_type')->get();
---
select `product_id`, `product_type` from `invoice_details`