app/Http/Controllers/ReportController.php

    public function index(){
        $report = InvoiceDetail::with('product')->get();
---
select * from `invoice_details`